In [1]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder,MinMaxScaler

In [2]:
CWD = os.getcwd()
os.path.join(CWD, "data")
DATA_PATH = os.path.join(CWD, "data")

#   1. daily_calendar Dataset

In [3]:
try:
    # Carga el archivo Excel en un objeto DataFrame
    daily_calendar_with_events = pd.read_csv(os.path.join(DATA_PATH, 'daily_calendar_with_events.csv'), sep=',')
except Exception as ex: 
    print(ex)

In [5]:
daily_calendar_with_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1913 entries, 0 to 1912
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1913 non-null   object
 1   weekday      1913 non-null   object
 2   weekday_int  1913 non-null   int64
 3   d            1913 non-null   object
 4   event        26 non-null     object
dtypes: int64(1), object(4)
memory usage: 74.9+ KB

In [6]:
daily_calendar_with_events['date'] = pd.to_datetime(daily_calendar_with_events['date'])
#daily_calendar_with_events['date'] = pd.to_datetime(daily_calendar_with_events['date']).dt.strftime('%Y-%m-%d')
daily_calendar_with_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1913 entries, 0 to 1912
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1913 non-null   datetime64[ns]
 1   weekday      1913 non-null   object
 2   weekday_int  1913 non-null   int64
 3   d            1913 non-null   object
 4   event        26 non-null     object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 74.9+ KB

In [5]:
#daily_calendar_with_events.to_pickle(datapath + 'daily_calendar.p')
#daily_calendar_with_events.to_csv(datapath + 'daily_calendar.csv', sep=';')

#   1.1 Analyse daily_calendar Dataset

In [7]:
#Necesitamos que la tabla item_sales tenga los valores de 'yearweek' . Vamos a agregar esta variable a daily_calendar, de tal forma que solo necesitemos mergear las tablas despues.
daily_calendar_with_events['year'] = daily_calendar_with_events['date'].dt.strftime('%Y')
daily_calendar_with_events['week'] = daily_calendar_with_events['date'].dt.strftime('%W')
daily_calendar_with_events['yearweek'] = daily_calendar_with_events['year'] + daily_calendar_with_events['week']
daily_calendar_with_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1913 entries, 0 to 1912
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1913 non-null   datetime64[ns]
 1   weekday      1913 non-null   object
 2   weekday_int  1913 non-null   int64
 3   d            1913 non-null   object
 4   event        26 non-null     object
 5   year         1913 non-null   object
 6   week         1913 non-null   object
 7   yearweek     1913 non-null   object
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 119.7+ KB

In [8]:
daily_calendar_with_events['yearweek'] = daily_calendar_with_events['yearweek'].astype('int64')
daily_calendar_with_events.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1913 entries, 0 to 1912
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1913 non-null   datetime64[ns]
 1   weekday      1913 non-null   object
 2   weekday_int  1913 non-null   int64
 3   d            1913 non-null   object
 4   event        26 non-null     object
 5   year         1913 non-null   object
 6   week         1913 non-null   object
 7   yearweek     1913 non-null   int64
dtypes: datetime64[ns](1), int64(2), object(5)
memory usage: 119.7+ KB

In [9]:
del(daily_calendar_with_events['year'])
del(daily_calendar_with_events['week'])

In [10]:
for i in ['weekday', 'weekday_int', 'event', 'yearweek'] :
    print(daily_calendar_with_events[i].value_counts())

Saturday     274
Sunday       274
Monday       273
Tuesday      273
Wednesday    273
Thursday     273
Friday       273
Name: weekday, dtype: int64
1    274
2    274
3    273
4    273
5    273
6    273
7    273
Name: weekday_int, dtype: int64
SuperBowl         6
Ramadan starts    5
Thanksgiving      5
NewYear           5
Easter            5
Name: event, dtype: int64
201336    7
201426    7
201432    7
201431    7
201430    7
         ..
201600    3
201352    2
201104    2
201200    1
201253    1
Name: yearweek, Length: 279, dtype: int64

In [11]:
daily_calendar_with_events.head()

        date    weekday  weekday_int    d event  yearweek
0 2011-01-29   Saturday            1  d_1   NaN    201104
1 2011-01-30     Sunday            2  d_2   NaN    201104
2 2011-01-31     Monday            3  d_3   NaN    201105
3 2011-02-01    Tuesday            4  d_4   NaN    201105
4 2011-02-02  Wednesday            5  d_5   NaN    201105

#   2. Item_Prices Dataset

In [12]:
try:
    # Carga el archivo Excel en un objeto DataFrame
    item_prices = pd.read_csv(os.path.join(DATA_PATH, 'item_prices.csv'), sep=',')
except Exception as ex: 
    print(ex)

In [13]:
item_prices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11038 entries, 0 to 11037
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   item        11038 non-null  object
 1   category    11038 non-null  object
 2   store_code  11038 non-null  object
 3   yearweek    10925 non-null  float64
 4   sell_price  11038 non-null  float64
dtypes: float64(2), object(3)
memory usage: 431.3+ KB

#   2.1 Analyse item_prices Dataset

In [14]:
item_prices.isna().sum()

item            0
category        0
store_code      0
yearweek      113
sell_price      0
dtype: int64

In [15]:
item_prices.columns

Index(['item', 'category', 'store_code', 'yearweek', 'sell_price'], dtype='object')

In [16]:
#Creo que debemos agregar la columna department(subgroup_category) a item_prices
#item_prices['department'] = item_prices['item'].str.slice(stop=-4)
item_prices['department'] = item_prices['item'].apply(lambda x: '_'.join(x.split('_')[:2]))
#item_prices['category'] = item_prices['item'].apply(lambda x: '_'.join(x.split('_')[:1]))

In [17]:
item_prices.head()

               item    category store_code  yearweek  sell_price    department
0  ACCESORIES_1_001  ACCESORIES      NYC_1  201328.0     12.7414  ACCESORIES_1
1  ACCESORIES_1_001  ACCESORIES      NYC_1  201330.0     10.9858  ACCESORIES_1
2  ACCESORIES_1_001  ACCESORIES      NYC_1  201615.0     11.1454  ACCESORIES_1
3  ACCESORIES_1_002  ACCESORIES      NYC_1  201125.0      5.2801  ACCESORIES_1
4  ACCESORIES_1_003  ACCESORIES      NYC_1  201405.0      3.9501  ACCESORIES_1

In [18]:
item_prices_order_of_columns = [
    'item', 
    'department',
    'category', 
    'store_code', 
    'yearweek', 
    'sell_price', 
]

item_prices = item_prices[item_prices_order_of_columns]
item_prices.head()

               item    department    category store_code  yearweek  sell_price
0  ACCESORIES_1_001  ACCESORIES_1  ACCESORIES      NYC_1  201328.0     12.7414
1  ACCESORIES_1_001  ACCESORIES_1  ACCESORIES      NYC_1  201330.0     10.9858
2  ACCESORIES_1_001  ACCESORIES_1  ACCESORIES      NYC_1  201615.0     11.1454
3  ACCESORIES_1_002  ACCESORIES_1  ACCESORIES      NYC_1  201125.0      5.2801
4  ACCESORIES_1_003  ACCESORIES_1  ACCESORIES      NYC_1  201405.0      3.9501

In [18]:
#item_prices.to_pickle(datapath + 'item_prices.p')
#daily_calendar_with_events.to_csv(datapath + 'daily_calendar.csv', sep=';')

#   3. item_sales Dataset

In [19]:
try:
    # Carga el archivo Excel en un objeto DataFrame
    item_sales = pd.read_csv(os.path.join(DATA_PATH, 'item_sales.csv'), sep=',')
except Exception as ex: 
    print(ex)

In [20]:
item_sales_melted = pd.melt(item_sales, id_vars=['id', 'item', 'category', 'department', 'store', 'store_code', 'region'],var_name='d', value_name='quantity')

In [21]:
item_sales_melted.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1287449 entries, 0 to 1287448
Data columns (total 9 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   id          1287449 non-null  object
 1   item        1287449 non-null  object
 2   category    1287449 non-null  object
 3   department  1287449 non-null  object
 4   store       1287449 non-null  object
 5   store_code  1287449 non-null  object
 6   region      1287449 non-null  object
 7   d           1287449 non-null  object
 8   quantity    1287449 non-null  int64
dtypes: int64(1), object(8)
memory usage: 88.4+ MB

In [22]:
item_sales = item_sales_melted[item_sales_melted['quantity'] > 0]

In [23]:
del(item_sales_melted)

In [24]:
item_sales.head()

,id,item,category,department,store,store_code,region,d,quantity
7,ACCESORIES_1_008_NYC_1,ACCESORIES_1_008,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_1,12
8,ACCESORIES_1_009_NYC_1,ACCESORIES_1_009,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_1,2
14,ACCESORIES_1_015_NYC_1,ACCESORIES_1_015,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_1,4
15,ACCESORIES_1_016_NYC_1,ACCESORIES_1_016,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_1,5
21,ACCESORIES_1_022_NYC_1,ACCESORIES_1_022,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_1,2

In [25]:
item_sales.reset_index(drop=True, inplace=True)

In [26]:
item_sales.isna().sum()

id            0
item          0
category      0
department    0
store         0
store_code    0
region        0
d             0
quantity      0
dtype: int64

In [27]:
item_sales.duplicated().value_counts()

False    417176
dtype: int64

In [28]:
#item_sales.to_pickle(datapath + 'item_sales.p')
#item_sales.to_csv(datapath + 'item_sales_clean.csv', sep=';')

In [29]:
item_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 417176 entries, 0 to 417175
Data columns (total 9 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id          417176 non-null  object
 1   item        417176 non-null  object
 2   category    417176 non-null  object
 3   department  417176 non-null  object
 4   store       417176 non-null  object
 5   store_code  417176 non-null  object
 6   region      417176 non-null  object
 7   d           417176 non-null  object
 8   quantity    417176 non-null  int64
dtypes: int64(1), object(8)
memory usage: 28.6+ MB

In [30]:
item_sales = item_sales.merge(daily_calendar_with_events[['d','date','yearweek']], on='d', how='left')

In [31]:
item_sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417176 entries, 0 to 417175
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id          417176 non-null  object
 1   item        417176 non-null  object
 2   category    417176 non-null  object
 3   department  417176 non-null  object
 4   store       417176 non-null  object
 5   store_code  417176 non-null  object
 6   region      417176 non-null  object
 7   d           417176 non-null  object
 8   quantity    417176 non-null  int64
 9   date        417176 non-null  datetime64[ns]
 10  yearweek    417176 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(8)
memory usage: 38.2+ MB

In [32]:
item_sales = item_sales.merge(item_prices[['item','yearweek','store_code','sell_price']], on=['item','yearweek','store_code'], how='left')

In [33]:
item_sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417176 entries, 0 to 417175
Data columns (total 12 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id          417176 non-null  object
 1   item        417176 non-null  object
 2   category    417176 non-null  object
 3   department  417176 non-null  object
 4   store       417176 non-null  object
 5   store_code  417176 non-null  object
 6   region      417176 non-null  object
 7   d           417176 non-null  object
 8   quantity    417176 non-null  int64
 9   date        417176 non-null  datetime64[ns]
 10  yearweek    417176 non-null  int64
 11  sell_price  3879 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(8)
memory usage: 41.4+ MB

In [34]:
item_sales.isna().sum()

id                 0
item               0
category           0
department         0
store              0
store_code         0
region             0
d                  0
quantity           0
date               0
yearweek           0
sell_price    413297
dtype: int64

In [35]:
item_sales = item_sales[item_sales['sell_price'].notna()]

In [36]:
item_sales.isna().sum()

id            0
item          0
category      0
department    0
store         0
store_code    0
region        0
d             0
quantity      0
date          0
yearweek      0
sell_price    0
dtype: int64

In [37]:
item_sales.head()

,id,item,category,department,store,store_code,region,d,quantity,date,yearweek,sell_price
301,ACCESORIES_1_009_NYC_1,ACCESORIES_1_009,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_3,7,2011-01-31,201105,2.0748
302,ACCESORIES_1_010_NYC_1,ACCESORIES_1_010,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_3,1,2011-01-31,201105,4.2161
303,ACCESORIES_1_016_NYC_1,ACCESORIES_1_016,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_3,3,2011-01-31,201105,0.9310
304,ACCESORIES_1_022_NYC_1,ACCESORIES_1_022,ACCESORIES,ACCESORIES_1,Greenwich_Village,NYC_1,New York,d_3,1,2011-01-31,201105,9.1238
305,ACCESORIES_2_004_NYC_1,ACCESORIES_2_004,ACCESORIES,ACCESORIES_2,Greenwich_Village,NYC_1,New York,d_3,1,2011-01-31,201105,3.2851

In [38]:
item_sales["revenue"] = item_sales["quantity"] * item_sales["sell_price"] 
item_sales["date_for_calc"] = item_sales["date"]

In [39]:
item_sales_order_of_columns = [
    'd',
    'date',
    'yearweek',
    'id',
    'item', 
    'department',
    'category',
    'store',
    'store_code',
    'region',
    'quantity',
    'sell_price',
    'revenue'
]

item_sales = item_sales[item_sales_order_of_columns]
item_sales.head()

,d,date,yearweek,id,item,department,category,store,store_code,region,quantity,sell_price,revenue
301,d_3,2011-01-31,201105,ACCESORIES_1_009_NYC_1,ACCESORIES_1_009,ACCESORIES_1,ACCESORIES,Greenwich_Village,NYC_1,New York,7,2.0748,14.5236
302,d_3,2011-01-31,201105,ACCESORIES_1_010_NYC_1,ACCESORIES_1_010,ACCESORIES_1,ACCESORIES,Greenwich_Village,NYC_1,New York,1,4.2161,4.2161
303,d_3,2011-01-31,201105,ACCESORIES_1_016_NYC_1,ACCESORIES_1_016,ACCESORIES_1,ACCESORIES,Greenwich_Village,NYC_1,New York,3,0.9310,2.7930
304,d_3,2011-01-31,201105,ACCESORIES_1_022_NYC_1,ACCESORIES_1_022,ACCESORIES_1,ACCESORIES,Greenwich_Village,NYC_1,New York,1,9.1238,9.1238
305,d_3,2011-01-31,201105,ACCESORIES_2_004_NYC_1,ACCESORIES_2_004,ACCESORIES_2,ACCESORIES,Greenwich_Village,NYC_1,New York,1,3.2851,3.2851

In [40]:
item_sales.reset_index(drop=True, inplace=True)
item_sales.head()

,d,date,yearweek,id,item,department,category,store,store_code,region,quantity,sell_price,revenue
0,d_3,2011-01-31,201105,ACCESORIES_1_009_NYC_1,ACCESORIES_1_009,ACCESORIES_1,ACCESORIES,Greenwich_Village,NYC_1,New York,7,2.0748,14.5236
1,d_3,2011-01-31,201105,ACCESORIES_1_010_NYC_1,ACCESORIES_1_010,ACCESORIES_1,ACCESORIES,Greenwich_Village,NYC_1,New York,1,4.2161,4.2161
2,d_3,2011-01-31,201105,ACCESORIES_1_016_NYC_1,ACCESORIES_1_016,ACCESORIES_1,ACCESORIES,Greenwich_Village,NYC_1,New York,3,0.9310,2.7930
3,d_3,2011-01-31,201105,ACCESORIES_1_022_NYC_1,ACCESORIES_1_022,ACCESORIES_1,ACCESORIES,Greenwich_Village,NYC_1,New York,1,9.1238,9.1238
4,d_3,2011-01-31,201105,ACCESORIES_2_004_NYC_1,ACCESORIES_2_004,ACCESORIES_2,ACCESORIES,Greenwich_Village,NYC_1,New York,1,3.2851,3.2851

#   <H3>Para trabajar con TimeSeries necesitamos tener las fechas en que hemos vendido y tambien en las que no hemos vendido. </H3>

Necesitamos tener cada ID con cada fecha posible, en este caso el analisis sera por Semanal

In [41]:
min_date = item_sales['date'].min()
min_year = min_date.strftime('%Y')
min_week = min_date.strftime('%W')
print(f'La primera fecha de venta es: {min_date}, que corresponde al año {min_year} y a la semana {min_week}')
max_date = item_sales['date'].max()
max_year = max_date.strftime('%Y')
max_week = max_date.strftime('%W')
print(f'La primera fecha de venta es: {max_date}, que corresponde al año {max_year} y a la semana {max_week}')

La primera fecha de venta es: 2011-01-31 00:00:00, que corresponde al año 2011 y a la semana 05
La primera fecha de venta es: 2016-04-17 00:00:00, que corresponde al año 2016 y a la semana 15

In [42]:
#Prediccion de 4 semanas
prediction_date = max_date + pd.DateOffset(4*7)
print(f'La ultima fecha que vamos a predecir de ventas es: {prediction_date}')

La ultima fecha que vamos a predecir de ventas es: 2016-05-15 00:00:00

In [43]:
unique_id = sorted(item_sales["id"].unique())
len(unique_id)

504

In [44]:
date_range = pd.date_range(min_date, prediction_date, freq = "W")
date_range

DatetimeIndex(['2011-02-06', '2011-02-13', '2011-02-20', '2011-02-27',
               '2011-03-06', '2011-03-13', '2011-03-20', '2011-03-27',
               '2011-04-03', '2011-04-10',
               ...
               '2016-03-13', '2016-03-20', '2016-03-27', '2016-04-03',
               '2016-04-10', '2016-04-17', '2016-04-24', '2016-05-01',
               '2016-05-08', '2016-05-15'],
              dtype='datetime64[ns]', length=276, freq='W-SUN')

In [45]:
len(date_range)

276

In [46]:
len(date_range)*len(unique_id)

139104

In [47]:
cartesian_product  = pd.MultiIndex.from_product([date_range, unique_id], names = ["date", "id"])
cartesian_product

MultiIndex([('2011-02-06',  'ACCESORIES_1_001_NYC_1'),
            ('2011-02-06',  'ACCESORIES_1_001_NYC_2'),
            ('2011-02-06',  'ACCESORIES_1_002_NYC_1'),
            ('2011-02-06',  'ACCESORIES_1_002_NYC_2'),
            ('2011-02-06',  'ACCESORIES_1_003_NYC_1'),
            ('2011-02-06',  'ACCESORIES_1_003_NYC_2'),
            ('2011-02-06',  'ACCESORIES_1_004_NYC_1'),
            ('2011-02-06',  'ACCESORIES_1_004_NYC_2'),
            ('2011-02-06',  'ACCESORIES_1_005_NYC_1'),
            ('2011-02-06',  'ACCESORIES_1_005_NYC_2'),
            ...
            ('2016-05-15', 'SUPERMARKET_3_037_NYC_1'),
            ('2016-05-15', 'SUPERMARKET_3_038_NYC_1'),
            ('2016-05-15', 'SUPERMARKET_3_039_NYC_1'),
            ('2016-05-15', 'SUPERMARKET_3_040_NYC_1'),
            ('2016-05-15', 'SUPERMARKET_3_041_NYC_1'),
            ('2016-05-15', 'SUPERMARKET_3_042_NYC_1'),
            ('2016-05-15', 'SUPERMARKET_3_043_NYC_1'),
            ('2016-05-15', 'SUPERMARKET_3_044_NYC_1'),
            ('2016-05-15', 'SUPERMARKET_3_045_NYC_1'),
            ('2016-05-15', 'SUPERMARKET_3_046_NYC_1')],
           names=['date', 'id'], length=139104)

In [48]:
ts_item_sales = pd.DataFrame(index = cartesian_product).reset_index()
print(ts_item_sales.shape)

(139104, 2)

Hasta aqui el producto cartesiano

Seteamos el indice de sales por ['date','id']

In [49]:
item_sales.set_index(['date','id'], inplace=True)

In [50]:
item_sales.head()

                                     d  yearweek              item  \
date       id
2011-01-31 ACCESORIES_1_009_NYC_1  d_3    201105  ACCESORIES_1_009
           ACCESORIES_1_010_NYC_1  d_3    201105  ACCESORIES_1_010
           ACCESORIES_1_016_NYC_1  d_3    201105  ACCESORIES_1_016
           ACCESORIES_1_022_NYC_1  d_3    201105  ACCESORIES_1_022
           ACCESORIES_2_004_NYC_1  d_3    201105  ACCESORIES_2_004

                                     department    category  \
date       id
2011-01-31 ACCESORIES_1_009_NYC_1  ACCESORIES_1  ACCESORIES
           ACCESORIES_1_010_NYC_1  ACCESORIES_1  ACCESORIES
           ACCESORIES_1_016_NYC_1  ACCESORIES_1  ACCESORIES
           ACCESORIES_1_022_NYC_1  ACCESORIES_1  ACCESORIES
           ACCESORIES_2_004_NYC_1  ACCESORIES_2  ACCESORIES

                                               store store_code    region  \
date       id
2011-01-31 ACCESORIES_1_009_NYC_1  Greenwich_Village      NYC_1  New York
           ACCESORIES_1_010_NYC_1  Greenwich_Village      NYC_1  New York
           ACCESORIES_1_016_NYC_1  Greenwich_Village      NYC_1  New York
           ACCESORIES_1_022_NYC_1  Greenwich_Village      NYC_1  New York
           ACCESORIES_2_004_NYC_1  Greenwich_Village      NYC_1  New York

                                   quantity  sell_price  revenue
date       id
2011-01-31 ACCESORIES_1_009_NYC_1         7      2.0748  14.5236
           ACCESORIES_1_010_NYC_1         1      4.2161   4.2161
           ACCESORIES_1_016_NYC_1         3      0.9310   2.7930
           ACCESORIES_1_022_NYC_1         1      9.1238   9.1238
           ACCESORIES_2_004_NYC_1         1      3.2851   3.2851

In [51]:
ts_item_sales = item_sales.reindex(cartesian_product)
ts_item_sales.reset_index(drop=False,inplace=True)
item_sales.reset_index(drop=False,inplace=True)

In [52]:
ts_item_sales

,date,id,d,yearweek,item,department,category,store,store_code,region,quantity,sell_price,revenue
0,2011-02-06,ACCESORIES_1_001_NYC_1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2011-02-06,ACCESORIES_1_001_NYC_2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2011-02-06,ACCESORIES_1_002_NYC_1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2011-02-06,ACCESORIES_1_002_NYC_2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2011-02-06,ACCESORIES_1_003_NYC_1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
139099,2016-05-15,SUPERMARKET_3_042_NYC_1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
139100,2016-05-15,SUPERMARKET_3_043_NYC_1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
139101,2016-05-15,SUPERMARKET_3_044_NYC_1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
139102,2016-05-15,SUPERMARKET_3_045_NYC_1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
139103,2016-05-15,SUPERMARKET_3_046_NYC_1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [53]:
unique_features_id = item_sales[['id', 'item', 'department', 'category', 'store', 'store_code','region']].drop_duplicates()
unique_features_id.shape

(504, 7)

Completamos los valores NaN con los valores agrupados ['item', 'department', 'category', 'store', 'store_code', 'region']

In [54]:
#Como hacerlo por vlookup xD

'''

for index, row in ts_item_sales.iterrows():
    id_value = row['id']
    matching_row = unique_features_id.loc[unique_features_id['id'] == id_value]
    
    if not matching_row.empty:
        # Completa los valores NaN en las columnas deseadas del primer dataset
        ts_item_sales.at[index, 'item'] = matching_row['item'].values[0]
        ts_item_sales.at[index, 'department'] = matching_row['department'].values[0]
        ts_item_sales.at[index, 'category'] = matching_row['category'].values[0]
        ts_item_sales.at[index, 'store'] = matching_row['store'].values[0]
        ts_item_sales.at[index, 'store_code'] = matching_row['store_code'].values[0]
        ts_item_sales.at[index, 'region'] = matching_row['region'].values[0]
        
'''

"\n\nfor index, row in ts_item_sales.iterrows():\n    id_value = row['id']\n    matching_row = unique_features_id.loc[unique_features_id['id'] == id_value]\n    \n    if not matching_row.empty:\n        # Completa los valores NaN en las columnas deseadas del primer dataset\n        ts_item_sales.at[index, 'item'] = matching_row['item'].values[0]\n        ts_item_sales.at[index, 'department'] = matching_row['department'].values[0]\n        ts_item_sales.at[index, 'category'] = matching_row['category'].values[0]\n        ts_item_sales.at[index, 'store'] = matching_row['store'].values[0]\n        ts_item_sales.at[index, 'store_code'] = matching_row['store_code'].values[0]\n        ts_item_sales.at[index, 'region'] = matching_row['region'].values[0]\n        \n"

In [55]:
mapping = unique_features_id.set_index('id')[['item', 'department', 'category', 'store', 'store_code','region']].to_dict()

In [56]:
# Aplicar el mapeo al primer dataset para completar los valores NaN en las columnas correspondientes
ts_item_sales['item'] = ts_item_sales['item'].fillna(ts_item_sales['id'].map(mapping['item']))
ts_item_sales['department'] = ts_item_sales['department'].fillna(ts_item_sales['id'].map(mapping['department']))
ts_item_sales['category'] = ts_item_sales['category'].fillna(ts_item_sales['id'].map(mapping['category']))
ts_item_sales['store'] = ts_item_sales['store'].fillna(ts_item_sales['id'].map(mapping['store']))
ts_item_sales['store_code'] = ts_item_sales['store_code'].fillna(ts_item_sales['id'].map(mapping['store_code']))
ts_item_sales['region'] = ts_item_sales['region'].fillna(ts_item_sales['id'].map(mapping['region']))

In [57]:
ts_item_sales

,date,id,d,yearweek,item,department,category,store,store_code,region,quantity,sell_price,revenue
0,2011-02-06,ACCESORIES_1_001_NYC_1,NaN,NaN,ACCESORIES_1_001,ACCESORIES_1,ACCESORIES,Greenwich_Village,NYC_1,New York,NaN,NaN,NaN
1,2011-02-06,ACCESORIES_1_001_NYC_2,NaN,NaN,ACCESORIES_1_001,ACCESORIES_1,ACCESORIES,Harlem,NYC_2,New York,NaN,NaN,NaN
2,2011-02-06,ACCESORIES_1_002_NYC_1,NaN,NaN,ACCESORIES_1_002,ACCESORIES_1,ACCESORIES,Greenwich_Village,NYC_1,New York,NaN,NaN,NaN
3,2011-02-06,ACCESORIES_1_002_NYC_2,NaN,NaN,ACCESORIES_1_002,ACCESORIES_1,ACCESORIES,Harlem,NYC_2,New York,NaN,NaN,NaN
4,2011-02-06,ACCESORIES_1_003_NYC_1,NaN,NaN,ACCESORIES_1_003,ACCESORIES_1,ACCESORIES,Greenwich_Village,NYC_1,New York,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
139099,2016-05-15,SUPERMARKET_3_042_NYC_1,NaN,NaN,SUPERMARKET_3_042,SUPERMARKET_3,SUPERMARKET,Greenwich_Village,NYC_1,New York,NaN,NaN,NaN
139100,2016-05-15,SUPERMARKET_3_043_NYC_1,NaN,NaN,SUPERMARKET_3_043,SUPERMARKET_3,SUPERMARKET,Greenwich_Village,NYC_1,New York,NaN,NaN,NaN
139101,2016-05-15,SUPERMARKET_3_044_NYC_1,NaN,NaN,SUPERMARKET_3_044,SUPERMARKET_3,SUPERMARKET,Greenwich_Village,NYC_1,New York,NaN,NaN,NaN
139102,2016-05-15,SUPERMARKET_3_045_NYC_1,NaN,NaN,SUPERMARKET_3_045,SUPERMARKET_3,SUPERMARKET,Greenwich_Village,NYC_1,New York,NaN,NaN,NaN
139103,2016-05-15,SUPERMARKET_3_046_NYC_1,NaN,NaN,SUPERMARKET_3_046,SUPERMARKET_3,SUPERMARKET,Greenwich_Village,NYC_1,New York,NaN,NaN,NaN